[{"_id":"654d1c4a453ef335c0728cce","title":"UFC® 4","description":"Shape Your Legend in EA SPORTS UFC 4.In EA SPORTS UFC 4 the fighter you become is shaped by your fight style, your achievements, and your personality.No matter how or where you play EA SPORTS UFC 4 puts‘ you’ at the center of every fight.","img":"https://image.api.playstation.com/vulcan/ap/rnd/202304/1709/a32c859fb333c861183ed8d595ea00a8fabddef31d1d49ef.jpg?w=440&thumb=false","trailer":"https://youtu.be/5epQZVC6F3Y?si=pM1dPW_eHjlKT-2y","cost":"$59.99","category":"sports","platform":"PS4","release":"8/14/2020","publisher":"Electronic Arts Inc","__v":0},{"_id":"654d2000453ef335c0728cd1","title":"NBA 2K24 Kobe Bryant Edition for PS4™","description":"Grab your squad and experience the past, present, and future of hoops culture in NBA 2K24. Enjoy loads of pure, authentic action and limitless personalized MyPLAYER options in MyCAREER. Collect an impressive array of legends and build your perfect lineup in MyTEAM. Feel more responsive gameplay and polished visuals while playing with your favorite NBA and WNBA teams in PLAY NOW.MAMBA MOMENTS™ Recreate some of Kobe’s most dominant and captivating performances during his rise to global superstardom. Revisit his early career triumphs as a young phenom, and progress through his transcendent journey from elite scorer to one of the greatest players of all time.","img":"https://image.api.playstation.com/vulcan/ap/rnd/202307/2809/a9fe3100a67c5d90e6cc5d24ebab09b8305468493192deac.jpg?w=620&thumb=false","trailer":"https://youtu.be/ZTtOLbgZShA?si=NcicockN7z8nI6oP","cost":"$59.99","category":"sports","platform":"PS4","release":"9/8/2023","publisher":"2K","__v":0},{"_id":"654d280d57089b49f9f16357","title":"EA SPORTS FC 24","description":"EA SPORTS FC™ 24 marks the beginning of the future of football.Built on innovation and authenticity, feel closer to the game in the most true - to - football experience yet with the best players from the biggest clubs, leagues and competitions around the globe.Experience unparalleled realism in every match thanks to three cutting - edge technologies: HyperMotionV, PlayStyles optimized by Opta and the enhanced Frostbite™ Engine.With more than 19, 000 fully licensed players, 700 teams and 30 leagues including the UEFA Men’ s and Women’ s Champions League, EA SPORTS FC 24 brings unrivalled authenticity to the pitch","img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSxpoOSV8uxC7Igt0nPSMve6PIMPYKOOOThGw&usqp=CAU","trailer":"https://youtu.be/XhP3Xh4LMA8?si=ofANWFHEgSU90B0-","cost":"$69.99","category":"sports","platform":"PS4, PS5","release":"9/29/2023","publisher":"Electronic Arts Inc","__v":0},{"_id":"654d2e79dbec63d74fc7dc57","title":"Tony Hawk's Pro Skater 1 + 2","description":"Drop back in with the most iconic skateboarding games ever made. Play Tony Hawk’s Pro Skater & Tony Hawk’s Pro Skater 2 in one epic collection, rebuilt from the ground up in incredible HD. All the pro skaters, levels and tricks are back and fully-remastered, plus more.","img":"https://gmedia.playstation.com/is/image/SIEPDC/tony-hawks-pro-skater-1-2-hero-01-ps4-en-09jul20?$800px--t$","trailer":"https://youtu.be/4paYDD0WIVY?si=MnAkQRDdEFMJOqfC","cost":"$49.99","category":"sports","platform":"PS4, PS5","release":"3/26/2021","publisher":"Activision","__v":0},{"_id":"654d8ed8e811e94b5c875f42","title":"Madden NFL 24","description":"With the newest iteration of FieldSENSE™ * , enjoy an enhanced gameplay foundation that brings all the ways you play between the hash marks to new heights in Madden NFL 24. NFL player physicality is on display like never before thanks to all - new SAPIEN Technology * , delivering a leap forward in NFL player authenticity with more body definition and variation to athlete physiques resulting in realistic player movement.","img":"https://image.api.playstation.com/vulcan/ap/rnd/202310/0418/c9ab15698c6284ade67c8a224e3a128841b5d22f03f94fb9.jpg?w=440&thumb=false","trailer":"https://youtu.be/4o6xDjg2B54?si=2NT82JSY3BUm4xv2","cost":"$69.99","category":"sports","platform":"PS4, PS5","release":"8/18/2023","publisher":"Electronic Arts Inc","__v":0},{"_id":"654d8ed8e811e94b5c875f48","title":"Marvel’s Spider-Man 2","description":"Spider - Men Peter Parker and Miles Morales face the ultimate test of strength inside and outside the mask as they fight to save the city, each other and the ones they love, from the monstrous Venom and the dangerous new symbiote threat. Explore an expansive Marvel’ s New York with faster web - swinging and the all - new Web Wings, quickly switching between Peter and Miles to experience different stories, epic new abilities and high - tech gear.","img":"https://image.api.playstation.com/vulcan/ap/rnd/202306/1219/97e9f5fa6e50c185d249956c6f198a2652a9217e69a59ecd.jpg?w=620&thumb=false","trailer":"https://youtu.be/nq1M_Wc4FIc?si=PTxdkwOjl0sevIXX","cost":"$59.99","category":"Action","platform":"PS5","release":"10/20/2023","publisher":"Sony Interactive Entertainment","__v":0},{"_id":"654d8ed8e811e94b5c875f4a","title":"Call of Duty®: Modern Warfare® III - Cross-Gen Bundle","description":"ALL NEW OPEN WORLD ZOMBIES.For the first time, team up with other squads to survive and fight massive hordes of the undead in the largest Call of Duty® Zombies map ever.Modern Warfare® Zombies(MWZ) tells a new Treyarch Zombies story with missions, core Zombies features, and secrets to discover.","img":"https://image.api.playstation.com/vulcan/ap/rnd/202308/1415/8d9af953f938ba6cb9f9e73cd94424df2d33b0f313794739.png?w=620&thumb=false","trailer":"https://youtu.be/mHDEDDrGYvo?si=GrM1GASc7g9CXuot","cost":"$69.99","category":"Action","platform":"PS4, PS5","release":"11/2/2023","publisher":"Activision","__v":0},{"_id":"654d8ed8e811e94b5c875f44","title":"Tomb Raider I-III Remastered Starring Lara Croft","description":"Solve Ancient Mysteries: Uncover treasures of the ancient world by solving puzzles and unraveling mysteries lost to the ravages of time.Globe-trotting Adventure: Follow Lara Croft around the world and face off against deadly foes and dangerous myths.Lovingly Restored: Experience the classics boasting upgraded graphics, with the option to switch to the original polygon look at any time.","img":"https://image.api.playstation.com/vulcan/ap/rnd/202308/1521/2a9a576f12f8901b5058856c3b299def44d3ddaa5c93b99f.png?w=440&thumb=false","trailer":"https://youtu.be/68hISohBKmI?si=Fj9g0WyCAUUo_lyB","cost":"$49.99","category":"Action","platform":"PS5","release":"2/14/2024","publisher":"Aspyr Media, Inc.","__v":0},{"_id":"654d8ed8e811e94b5c875f46","title":"HELLDIVERS™ 2","description":"BECOME A LEGENDYou will be assembled into squads of up to four Helldivers and assigned strategic missions.Watch each other’s back – friendly fire is an unfortunate certainty of war, but victory without teamwork is impossible.*LOADOUTSRain down freedom from above, sneak through enemy territory, or grit your teeth and charge head-first into the jaws of combat.How you deliver liberty is your choice; you’ll have access to a wide array of explosive firepower, life-saving armor and battle-changing stratagems… the jewel in every Helldiver’s arsenal.REQUISITIONSuper Earth recognises your hard work with valuable Requisition. Use it to access different rewards that benefit you, your squad, your destroyer ship and our overall war effort.THREATSEverything on every planet wants you dead. That’s what we’re dealing with.Each enemy has distinct and unpredictable characteristics, tactics, and behavior – but they all fight ferociously and without fear or morality.THE GALACTIC WARCapturing enemy planets, defending against invasions, and completing missions will contribute to our overall effort.This war will be won or lost depending on the actions of everyone involved.We stand together, or we fall apart.TACTICAL WARFARE- Adaptive triggers: Discover recoil, rate of fire and the weight of each weapon.- Haptic feedback: Feel alien worlds come to life with environmental, equipment and weather effects.- Built-in microphone: Swap tactics with your comrades in the chaos of combat.- PS5® Tempest 3D AudioTech: Pinpoint approaching enemies, nearby battles, and distant screams from any direction.**","img":"https://image.api.playstation.com/vulcan/ap/rnd/202309/2116/3f1bd2f20b06047e0f029d44c909a2a58b45e7fc6ae1dd0f.jpg?w=440&thumb=false","trailer":"https://youtu.be/lUaaT_k9Nv8?si=w-pqnqswl64wdwxH","cost":"$39.99","category":"Action","platform":"PS5","release":"2/8/2024","publisher":"Sony Interactive Entertainment","__v":0},{"_id":"654deb412c8dbc813c6213a3","title":"God of War Ragnarök","description":"Embark on an epic and heartfelt journey as Kratos and Atreus struggle with holding on and letting goFrom Santa Monica Studio comes the sequel to the critically acclaimed God of War (2018). Fimbulwinter is well underway. Kratos and Atreus must journey to each of the Nine Realms in search of answers as Asgardian forces prepare for a prophesied battle that will end the world. Along the way they will explore stunning, mythical landscapes, and face fearsome enemies in the form of Norse gods and monsters. The threat of Ragnarök grows ever closer. Kratos and Atreus must choose between their own safety and the safety of the realms.","img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSQcAzBoX-1iCXJexvalfT9oUNCGr9XhOlfig&usqp=CAU","trailer":"https://youtu.be/EE-4GvjKcfs?si=V1vqsbwflnt1PdYf","cost":"$69.99","category":"Action","platform":"PS4, PS5","release":"11/09/2022","publisher":"Sony Interactive Entertainment","__v":0},{"_id":"654deb412c8dbc813c6213a9","title":"Uncharted 4: A Thief's End","description":"On the hunt for Captain Henry Avery’s long-lost treasure, Sam and Drake set off to find Libertalia, the pirate utopia deep in the forests of Madagascar. UNCHARTED 4: A Thief’s End takes players on a journey around the globe, through jungle isles, far-flung cities and snow-capped peaks on the search for Avery’s fortune.","img":"https://gmedia.playstation.com/is/image/SIEPDC/uncharted-4-a-thiefs-end-accolades-screen-01-ps4-us-12may16?$800px$","trailer":"https://youtu.be/hh5HV4iic1Y?si=-DZQfOiRjsqIqGLj","cost":"$69.99","category":"Action","platform":"PS4, PS5","release":"05/10/2015","publisher":"Sony Interactive Entertainment","__v":0},{"_id":"654deb412c8dbc813c6213ab","title":"Horizon Forbidden West™: Burning Shores","description":"Travel beyond the Forbidden West as Aloy’ s story continues.Encounter new machines and a compelling new story.South of the Tenakth Clan Lands, millennia of volcanic eruptions and violent seismic activity have carved the ruins of Los Angeles into a treacherous archipelago.Experience the next chapter of Horizon Forbidden West as Aloy pursues a sinister new threat to the planet, hidden among these dangerous, untamed wilds.","img":"https://gmedia.playstation.com/is/image/SIEPDC/Horizon-Burning-Shores-hero-mobile-01-en-23feb23?$800px$","trailer":"https://youtu.be/Lbl2wfyAgxY?si=09Ycup1nKfv93VH6","cost":"$19.99","category":"Action","platform":"PS5","release":"4/19/2023","publisher":"Sony Interactive Entertainment","__v":0},{"_id":"654deb412c8dbc813c6213a5","title":"The Last of Us Part II","description":"Five years after their dangerous journey across the post - pandemic United States, Ellie and Joel have settled down in Jackson, Wyoming.Living amongst a thriving community of survivors has allowed them peace and stability, despite the constant threat of the infected and other, more desperate survivors. When a violent event disrupts that peace, Ellie embarks on a relentless journey to carry out justice and find closure.As she hunts those responsible one by one, she is confronted with the devastating physical and emotional repercussions of her actions.","img":"https://gmedia.playstation.com/is/image/SIEPDC/the-last-of-us-part-ii-e3-2018-screen-08-ps4-us-10jul18?$800px$","trailer":"https://youtu.be/vhII1qlcZ4E?si=Dq33WfaL_mYSP9fX","cost":"$39.99","category":"Action","platform":"PS4, PS5","release":"6/19/2020","publisher":"Sony Interactive Entertainment","__v":0},{"_id":"654deb412c8dbc813c6213a7","title":"Red Dead Redemption 2","description":"After a robbery goes badly wrong in the western town of Blackwater, Arthur Morgan and the Van der Linde gang are forced to flee.With federal agents and the best bounty hunters in the nation massing on their heels, the gang must rob, steal and fight their way across the rugged heartland of America in order to survive. As deepening internal divisions threaten to tear the gang apart, Arthur must make a choice between his own ideals and loyalty to the gang who raised him.","img":"https://gmedia.playstation.com/is/image/SIEPDC/red-dead-redemption-2-hero-mobile-01-ps4-en-28jul20?$800px$","trailer":"https://youtu.be/F63h3v9QV7w?si=T9sHIIArtpgLXIFu","cost":"$59.99","category":"Action, Adventure, Unique","platform":"PS4, PS5","release":"10/26/2018","publisher":"Rockstar Games","__v":0},{"_id":"655dc7e51ed05055500baf0d","title":"LEGO® 2K Drive","description":"Race across the streets, seas and sands as you build your dream rides, brick by brick, and enjoy LEGO® 2 K Drive 's sprawling story mode.Defeat a cast of colorful and memorable racing rivals as you drift and boost your way from racetrack rookie to winner of the coveted Sky trophy.Play together with a friend at home or with up to five pals online in the crossplay - enabled Play With Friends and Play With Everyone online modes.Explore Bricklandia together, or show off your skills in Cup Series and Race modes.From mini - games to side missions, a whole host of vehicle - filled fun awaits you.","img":"https://gmedia.playstation.com/is/image/SIEPDC/lego-2k-drive-hero-banner-mobile-01-en-18apr23?$800px$","trailer":"https://youtu.be/HLuK8_AmAx4?si=Sxk2D6do_6aYaQnP","cost":"$69.99","category":"Race","platform":"PS4, PS5","release":"5/19/2023","publisher":"2K","__v":0},{"_id":"655dc86cf2950fd6a9f2d877","title":"GRID Legends","description":"Discover what it takes to become a racing legend Welcome to GRID Legends: a high - stakes driving experience that combines thrilling and unpredictable motorsport, incredible race variety and an immersive narrative that puts you at the heart of the action.Take the spotlight in an engrossing racing story, brought to life by a world - class cast including Ncuti Gatwa(Sex Education), in a ground - breaking extended reality production.Face fierce personalities, paddock politics, on - track drama and the infamous Ravenwest Motorsport, as a fly - on - the - wall documentary captures every moment.","img":"https://gmedia.playstation.com/is/image/SIEPDC/grid-legends-hero-01-en-5oct21?$800px$","trailer":"https://youtu.be/1Vgj1I3YG8g?si=7Mfar92FrvIhWas2","cost":"$59.99","category":"Race","platform":"PS4, PS5","release":"2/25/2022","publisher":"Electronic Arts","__v":0},{"_id":"655dc86c772ce108376104a7","title":"Riders Republic","description":"Squad up with your friends and compete in a wide range of multiplayer modes: feel the rush of downhill races, dominate maps in team vs team competitions, or give it your best shot in epic mass PvP races with more than 50 other players.Live out the rider 's fantasy as you roam free in a huge, vibrant open world, always buzzing with other players around you. Immerse yourself in iconic American national parks including Bryce Canyon, Yosemite Valley, Mammoth Mountain... all mashed up for you to shred!","img":"https://gmedia.playstation.com/is/image/SIEPDC/riders-republic-hero-banner-mobile-01-en-19oct21?$800px$","trailer":"https://youtu.be/tasjYid5Yec?si=MduuHpSejRfGgZbP","cost":"$9.99","category":"Race","platform":"PS4, PS5","release":"10/28/2021","publisher":"Ubisoft","__v":0},{"_id":"655dc86c86687d1e97f0b675","title":"The Crew Motorfest","description":"The latest chapter of the open world action-driving series transforms the beautiful Hawaiian island of O’ahu into a premiere racing destination.This diverse playground is yours to explore, from the city streets of Honolulu and rainforest dirt tracks, to drift-friendly mountain roads and challenging volcano slopes.Experience this motor paradise solo or with your crew, as you take the wheel of hundreds of legendary licensed vehicles and participate in thrilling races, themed events and unique challenges. Whatever aspect of car culture you enjoy, there’s something here for you.","img":"https://gmedia.playstation.com/is/image/SIEPDC/the-crew-motorfest-hero-banner-mobile-01-en-30may23?$800px$","trailer":"https://youtu.be/d4JnshyKOOQ?si=g-JSm4Pt76ONW8ef","cost":"$41.99","category":"Race","platform":"PS4, PS5","release":"9/14/2023","publisher":"Ubisoft Entertainment","__v":0},{"_id":"655dc8da86687d1e97f0b677","title":"Need for Speed Unbound","description":"What is Need for Speed Unbound?Start at the bottom, race to the top in the latest entry in the iconic Need for Speed franchiseWith separate single and multiplayer campaigns, this latest edition in the Need for Speed franchise from Criterion Games delivers hours of electric, adrenaline-pumping racing action.Race against time, outsmart the cops, and take on weekly qualifiers to reach The Grand, Lakeshore's ultimate street racing challenge. Pack your garage with precision-tuned, custom rides and light up the streets with your style, exclusive fits, and a vibrant global soundtrack that bumps in every corner of the world.  ","img":"https://gmedia.playstation.com/is/image/SIEPDC/Need-for-speed-unbound-hero-mobile-01-en-20sep22?$800px$","trailer":"https://youtu.be/H2Y8XCe7F9E?si=riFg1v7irmrjEK8W","cost":"$79.99","category":"Race","platform":"PS5","release":"11/29/2022","publisher":"Electronic Arts","__v":0}]